#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-JE8MuMNJd1J6JhEy

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js.map"]: Refreshing state... [id=static/js/612.7a501a2d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js"]: Refreshing state... [id=static/js/612.7a501a2d.chunk.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.map"]: Refreshing state... [id=static/js/main.24f73f18.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js"]: Refreshing state... [id=static/js/main.24f73f18.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"]: Refreshing state... [id=static/css/main.dce9ee63.css.map]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.map"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.24f73f18.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"]: Refreshing state... [id=static/css/main.dce9ee63.css]
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "f5d2632f289ff96aad22d2924fd9f192" -> "2c5d61f9ef5af64c4cd64c79da07c09d"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "mI3iRi4SmAmwnH2l4.rZ98lVyxt507n7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "59f589a282dcc2f4cf4b2bf9f8103f22" -> "68d12981e742721e61fadc9c778e291f"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "Yg9zdm9LrkBL54WnIalq2btrolwmEn7p" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "41cbe9379bef680be9ffcdbc146b616c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.61b89840.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.61b89840.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "af2d535cece7f0afcb370856903068d2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.61b89840.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.61b89840.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"] will be destroyed
  # (because key ["static/css/main.dce9ee63.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "01e7c205a10688ca18d159fd728b306f" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.dce9ee63.css" -> null
      - key                    = "static/css/main.dce9ee63.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.dce9ee63.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "8N1NvqlWZ16ZYZLN4xfTanIh5gZxIzeO" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"] will be destroyed
  # (because key ["static/css/main.dce9ee63.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "e8df89e9b15c8d36ab6734c4ddce4ba9" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.dce9ee63.css.map" -> null
      - key                    = "static/css/main.dce9ee63.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.dce9ee63.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "y3__bDBNZR3gn5C5nCJwst2wUFEiEK62" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js"] will be destroyed
  # (because key ["static/js/main.24f73f18.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "cb57000ec9cd19f1d130699807c90d37" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.24f73f18.js" -> null
      - key                    = "static/js/main.24f73f18.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.24f73f18.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "0s.kFBmpS1KbKKUx3PpzYQ6QZtvATUMr" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.24f73f18.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "c08095d410fcc127f60d880f425f8221" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.24f73f18.js.LICENSE.txt" -> null
      - key                    = "static/js/main.24f73f18.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.24f73f18.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "0LQxw1fZLRnqSVNgiOP4fqcp8RW6ePgw" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.24f73f18.js.map"] will be destroyed
  # (because key ["static/js/main.24f73f18.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "0232fe8045fd46e75b7fecffd7bba2db" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.24f73f18.js.map" -> null
      - key                    = "static/js/main.24f73f18.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.24f73f18.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "JMDkuZVGvKKNsvC_oL_HbGOllp5Gv.t2" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6e35924e.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ee981e023066702c6a66ff20bf22055b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6e35924e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6e35924e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6e35924e.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "c08095d410fcc127f60d880f425f8221"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6e35924e.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6e35924e.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6e35924e.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "51db18f47b3e6f6b90cf5db8aff49c24"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6e35924e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6e35924e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*